of-project-2/Re-20/fine/large/system/blockMeshDict
Fine Large 
// Lf = 60 
// Lw = 30 
// R = 8 
// H = 60 
// Re = 20 
FoamFile
{
    version  2.0;
    format   ascii;
    class    dictionary;
    object   blockMeshDict;
}

convertToMeters 1.0;

vertices 
( 
   (0.500000  0.000000  -0.050000) // 0 
   (0.353553  0.353553  -0.050000) // 1 
   (0.000000  0.500000  -0.050000) // 2 
   (-0.353553  0.353553  -0.050000) // 3 
   (-0.500000  0.000000  -0.050000) // 4 
   (-0.353553  -0.353553  -0.050000) // 5 
   (-0.000000  -0.500000  -0.050000) // 6 
   (0.353553  -0.353553  -0.050000) // 7 
   (8.500000  -0.000000  -0.050000) // 8 
   (6.010408  6.010408  -0.050000) // 9 
   (0.000000  8.500000  -0.050000) // 10 
   (-6.010408  6.010408  -0.050000) // 11 
   (-8.500000  0.000000  -0.050000) // 12 
   (-6.010408  -6.010408  -0.050000) // 13 
   (-0.000000  -8.500000  -0.050000) // 14 
   (6.010408  -6.010408  -0.050000) // 15 
   (30.000000  0.000000  -0.050000) // 16 
   (30.000000  6.010408  -0.050000) // 17 
   (30.000000  60.000000  -0.050000) // 18 
   (6.010408  60.000000  -0.050000) // 19 
   (0.000000  60.000000  -0.050000) // 20 
   (-6.010408  60.000000  -0.050000) // 21 
   (-60.000000  60.000000  -0.050000) // 22 
   (-60.000000  6.010408  -0.050000) // 23 
   (-60.000000  0.000000  -0.050000) // 24 
   (-60.000000  -6.010408  -0.050000) // 25 
   (-60.000000  -60.000000  -0.050000) // 26 
   (-6.010408  -60.000000  -0.050000) // 27 
   (0.000000  -60.000000  -0.050000) // 28 
   (6.010408  -60.000000  -0.050000) // 29 
   (30.000000  -60.000000  -0.050000) // 30 
   (30.000000  -6.010408  -0.050000) // 31 
   (0.500000  -0.000000  0.050000) // 32 
   (0.353553  0.353553  0.050000) // 33 
   (-0.000000  0.500000  0.050000) // 34 
   (-0.353553  0.353553  0.050000) // 35 
   (-0.500000  0.000000  0.050000) // 36 
   (-0.353553  -0.353553  0.050000) // 37 
   (-0.000000  -0.500000  0.050000) // 38 
   (0.353553  -0.353553  0.050000) // 39 
   (8.500000  -0.000000  0.050000) // 40 
   (6.010408  6.010408  0.050000) // 41 
   (-0.000000  8.500000  0.050000) // 42 
   (-6.010408  6.010408  0.050000) // 43 
   (-8.500000  0.000000  0.050000) // 44 
   (-6.010408  -6.010408  0.050000) // 45 
   (-0.000000  -8.500000  0.050000) // 46 
   (6.010408  -6.010408  0.050000) // 47 
   (30.000000  0.000000  0.050000) // 48 
   (30.000000  6.010408  0.050000) // 49 
   (30.000000  60.000000  0.050000) // 50 
   (6.010408  60.000000  0.050000) // 51 
   (0.000000  60.000000  0.050000) // 52 
   (-6.010408  60.000000  0.050000) // 53 
   (-60.000000  60.000000  0.050000) // 54 
   (-60.000000  6.010408  0.050000) // 55 
   (-60.000000  0.000000  0.050000) // 56 
   (-60.000000  -6.010408  0.050000) // 57 
   (-60.000000  -60.000000  0.050000) // 58 
   (-6.010408  -60.000000  0.050000) // 59 
   (0.000000  -60.000000  0.050000) // 60 
   (6.010408  -60.000000  0.050000) // 61 
   (30.000000  -60.000000  0.050000) // 62 
   (30.000000  -6.010408  0.050000) // 63 
); 

blocks 
( 

   // block 0 
   hex (0 8 9 1 32 40 41 33) (20 40 1) simpleGrading (2 1 1) 

   // block 1 
   hex (1 9 10 2 33 41 42 34) (20 40 1) simpleGrading (2 1 1) 

   // block 2 
   hex (2 10 11 3 34 42 43 35) (20 40 1) simpleGrading (2 1 1) 

   // block 3 
   hex (3 11 12 4 35 43 44 36) (20 40 1) simpleGrading (2 1 1) 

   // block 4 
   hex (4 12 13 5 36 44 45 37) (20 40 1) simpleGrading (2 1 1) 

   // block 5 
   hex (5 13 14 6 37 45 46 38) (20 40 1) simpleGrading (2 1 1) 

   // block 6 
   hex (6 14 15 7 38 46 47 39) (20 40 1) simpleGrading (2 1 1) 

   // block 7 
   hex (7 15 8 0 39 47 40 32) (20 40 1) simpleGrading (2 1 1) 

   // block 8 
   hex (8 16 17 9 40 48 49 41) (50 40 1) simpleGrading (4 1 1) 

   // block 9 
   hex (9 17 18 19 41 49 50 51) (50 50 1) simpleGrading (4 2 1) 

   // block 10 
   hex (10 9 19 20 42 41 51 52) (40 50 1) simpleGrading (1 2 1) 

   // block 11 
   hex (11 10 20 21 43 42 52 53) (40 50 1) simpleGrading (1 2 1) 

   // block 12 
   hex (23 11 21 22 55 43 53 54) (50 50 1) simpleGrading (0.25 2 1) 

   // block 13 
   hex (24 12 11 23 56 44 43 55) (50 40 1) simpleGrading (0.25 1 1) 

   // block 14 
   hex (25 13 12 24 57 45 44 56) (50 40 1) simpleGrading (0.25 1 1) 

   // block 15 
   hex (26 27 13 25 58 59 45 57) (50 50 1) simpleGrading (0.25 0.5 1) 

   // block 16 
   hex (27 28 14 13 59 60 46 45) (40 50 1) simpleGrading (1 0.5 1) 

   // block 17 
   hex (28 29 15 14 60 61 47 46) (40 50 1) simpleGrading (1 0.5 1) 

   // block 18 
   hex (29 30 31 15 61 62 63 47) (50 50 1) simpleGrading (4 0.5 1) 

   // block 19 
   hex (15 31 16 8 47 63 48 40) (50 40 1) simpleGrading (4 1 1) 

); 
 
edges 
( 
 
arc 0 1 ( 0.46194 0.19134 -0.05) 
arc 1 2 ( 0.19134 0.46194 -0.05) 
arc 2 3 ( -0.19134 0.46194 -0.05) 
arc 3 4 ( -0.46194 0.19134 -0.05) 
arc 4 5 ( -0.46194 -0.19134 -0.05) 
arc 5 6 ( -0.19134 -0.46194 -0.05) 
arc 6 7 ( 0.19134 -0.46194 -0.05) 
arc 7 0 ( 0.46194 -0.19134 -0.05) 
arc 8 9 ( 7.853 3.2528 -0.05) 
arc 9 10 ( 3.2528 7.853 -0.05) 
arc 10 11 ( -3.2528 7.853 -0.05) 
arc 11 12 ( -7.853 3.2528 -0.05) 
arc 12 13 ( -7.853 -3.2528 -0.05) 
arc 13 14 ( -3.2528 -7.853 -0.05) 
arc 14 15 ( 3.2528 -7.853 -0.05) 
arc 15 8 ( 7.853 -3.2528 -0.05) 
arc 32 33 ( 0.46194 0.19134 0.05) 
arc 33 34 ( 0.19134 0.46194 0.05) 
arc 34 35 ( -0.19134 0.46194 0.05) 
arc 35 36 ( -0.46194 0.19134 0.05) 
arc 36 37 ( -0.46194 -0.19134 0.05) 
arc 37 38 ( -0.19134 -0.46194 0.05) 
arc 38 39 ( 0.19134 -0.46194 0.05) 
arc 39 32 ( 0.46194 -0.19134 0.05) 
arc 40 41 ( 7.853 3.2528 0.05) 
arc 41 42 ( 3.2528 7.853 0.05) 
arc 42 43 ( -3.2528 7.853 0.05) 
arc 43 44 ( -7.853 3.2528 0.05) 
arc 44 45 ( -7.853 -3.2528 0.05) 
arc 45 46 ( -3.2528 -7.853 0.05) 
arc 46 47 ( 3.2528 -7.853 0.05) 
arc 47 40 ( 7.853 -3.2528 0.05) 

 ); 
 
boundary
(

  inlet
  {
      type patch;
      faces
      (
         (22 54 55 23)
         (23 55 56 24)
         (24 56 57 25)
         (25 57 58 26)
      );
  }

  outlet
  {
      type patch;
      faces
      (
         (18 50 49 17)
         (17 49 48 16)
         (16 48 63 31)
         (31 63 62 30)
      );
  }

  cylinder
  {
      type wall;
      faces
      (
         (0 32 33 1)
         (1 33 34 2)
         (2 34 35 3)
         (3 35 36 4)
         (4 36 37 5)
         (5 37 38 6)
         (6 38 39 7)
         (7 39 32 0)
      );
  }

  top
  {
      type symmetryPlane;
      faces
      (
         (22 54 53 21)
         (21 53 52 20)
         (20 52 51 19)
         (19 51 50 18)
      );
  }

  bottom
  {
      type symmetryPlane;
      faces
      (
         (26 58 59 27)
         (27 59 60 28)
         (28 60 61 29)
         (29 61 62 30)
      );
  }

);
